//=============================================================================
// # 17 Напишите программу, которая принимает на вход
// координаты точки (X и Y), причём X ≠ 0 и Y ≠ 0 и
// выдаёт номер четверти плоскости, в которой
// находится эта точка.
//=============================================================================

int ReadData(string line)
{
    // Выводим сообщение
    Console.Write(line);
    // Считываем число
    int number = int.Parse(Console.ReadLine() ?? "0");
    // Возвращаем значение
    return number;
}

int QuarterTest(int x, int y) // Дописать метод в записи
{
    if (x > 0 && y > 0)
    {
        return 1;
    }
}

void PrintResult(string line)
{
    Console.WriteLine(line);
}